export const data = [
  {
    id: 1770714672586,
    content:
      '你好是叫什么名字，你好是叫什么名字，你好是叫什么名字，你好是叫什么名字，你好是叫什么名字，你好是叫什么名字，',
    type: 'question'
  },
  {
    id: 1770714672587,
    //   content: `**杭州的一级告警详情是什么**
    // | 序号 | 业务的影响 | 告警标题 | 原始告警流水号 | 告警定位信息 | 地市 | 网元名称 | 设备类型 | 网络专业 | 告警最后发生时间 | 网络类型 | 告警级别 | 资源池 | 机房名称 | 告警处理建议 |
    // | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |
    // | 1 | 未知 | Boot密码为默认密码 | 1391432221 | 核心网-5GTOC:10.211.53.90:null | 杭州市 | ZJHZ-GI-GPRS-FW59-SQHW | 防火墙 | 核心网 | 2026-02-11 10:12:07 | 配套设备 | PS_CRITICAL | 未知 | 杭州石桥枢纽三号楼4楼机房 | 未知 |`,
    content:
      '这是一个简单的示例，展示了如何在 Markdown 中混合使用文字和表格。\n\n## 项目介绍\n\n以下是我们的产品列表，包括价格和库存信息：\n\n| 项目   | 描述         | 价格   | 库存 |\n|--------|--------------|--------|------|\n| 苹果   | 新鲜红富士   | ¥12.5  | 50   |\n| 香蕉   | 海南香蕉     | ¥8.0   | 30   |\n| 橙子   | 赣南脐橙     | ¥15.0  | 20   |\n\n我们还提供高质量的产品图片：\n\n![水果图片](https://picsum.photos/200/300 "水果展示")[📥 点击下载文件](https://picsum.photos/200/300)\n\n### 说明\n\n- **苹果**：产自山东，口感脆甜。\n- **香蕉**：来自海南，营养丰富。\n- **橙子**：江西赣州特产，汁多味甜。\n\n如有任何问题，请随时联系我们！',
    type: 'answer',
    loadingTexts: [
      { id: 0, value: '规划中......' },
      {
        id: 1,
        value:
          "任务规划候选的工具/智能体集: ['日报问答', '性能指标查询', '台风场景问答', '统一知识库问答', '图表绘制工具', '任务终止工具', '家宽服务质量指标查询', '项目介绍工具']"
      },
      { id: 2, value: "最终选中的工具/智能体集：['项目介绍工具']" },
      { id: 3, value: '调用：项目介绍工具 结束', type: 'endNode' }
    ],
    reasoning: '测试深度思考文案'
  }
  // {
  //   id: 1770714672586,
  //   content:
  //     '你好是叫什么名字，你好是叫什么名字，你好是叫什么名字，你好是叫什么名字，你好是叫什么名字，你好是叫什么名字，',
  //   type: 'question'
  // },
  // {
  //   id: 1770714672587,
  //   content: {
  //     chat: '杭州市各市区的数据',
  //     // 柱状图
  //     // query_chat_details: [
  //     //   {
  //     //     title: '在岗装维数',
  //     //     chart_type: 1,
  //     //     data: [
  //     //       {
  //     //         legend: '人数',
  //     //         x: {
  //     //           上城: 88,
  //     //           临安: 56,
  //     //           临平: 87,
  //     //           余杭: 86,
  //     //           富阳: 59,
  //     //           建德: 37,
  //     //           拱墅: 85,
  //     //           桐庐: 31,
  //     //           淳安: 25,
  //     //           滨江: 25,
  //     //           萧山: 169,
  //     //           西湖: 68,
  //     //           钱塘: 49
  //     //         }
  //     //       }
  //     //     ]
  //     //   }
  //     // ],
  //     //折线图
  //     query_chat_details: [
  //       {
  //         title: '受理工单数据',
  //         chart_type: 3,
  //         data: [
  //           {
  //             legend: '投诉',
  //             x: {
  //               '03-01': 1360,
  //               '03-02': 945,
  //               '03-03': 894,
  //               '03-04': 914,
  //               '03-05': 876,
  //               '03-06': 926,
  //               '03-07': 1131,
  //               '03-08': 943,
  //               '03-09': 895,
  //               '03-10': 872,
  //               '03-11': 845,
  //               '03-12': 762,
  //               '03-13': 833,
  //               '03-14': 1044,
  //               '03-15': 960,
  //               '03-16': 795,
  //               '03-17': 838,
  //               '03-18': 910,
  //               '03-19': 927,
  //               '03-20': 1001,
  //               '03-21': 1102,
  //               '03-22': 1062,
  //               '03-23': 990,
  //               '03-24': 990,
  //               '03-25': 1042,
  //               '03-26': 987,
  //               '03-27': 1142,
  //               '03-28': 1175,
  //               '03-29': 1193,
  //               '03-30': 1099,
  //               '03-31': 1061
  //             }
  //           },
  //           {
  //             legend: '其它',
  //             x: {
  //               '03-01': 9047,
  //               '03-02': 3836,
  //               '03-03': 3353,
  //               '03-04': 3240,
  //               '03-05': 5132,
  //               '03-06': 3923,
  //               '03-07': 3268,
  //               '03-08': 2783,
  //               '03-09': 2782,
  //               '03-10': 2710,
  //               '03-11': 9835,
  //               '03-12': 3563,
  //               '03-13': 3117,
  //               '03-14': 3461,
  //               '03-15': 3043,
  //               '03-16': 3274,
  //               '03-17': 2871,
  //               '03-18': 2809,
  //               '03-19': 3249,
  //               '03-20': 3708,
  //               '03-21': 3654,
  //               '03-22': 3547,
  //               '03-23': 2713,
  //               '03-24': 2609,
  //               '03-25': 2670,
  //               '03-26': 3500,
  //               '03-27': 3062,
  //               '03-28': 3235,
  //               '03-29': 2730,
  //               '03-30': 2967,
  //               '03-31': 3437
  //             }
  //           },
  //           {
  //             legend: '装机',
  //             x: {
  //               '03-01': 6443,
  //               '03-02': 5524,
  //               '03-03': 4966,
  //               '03-04': 4611,
  //               '03-05': 5093,
  //               '03-06': 5570,
  //               '03-07': 5851,
  //               '03-08': 5088,
  //               '03-09': 4913,
  //               '03-10': 4652,
  //               '03-11': 4406,
  //               '03-12': 5322,
  //               '03-13': 5338,
  //               '03-14': 5606,
  //               '03-15': 5038,
  //               '03-16': 4942,
  //               '03-17': 4388,
  //               '03-18': 3996,
  //               '03-19': 4920,
  //               '03-20': 5319,
  //               '03-21': 5579,
  //               '03-22': 4900,
  //               '03-23': 4789,
  //               '03-24': 4205,
  //               '03-25': 4365,
  //               '03-26': 5409,
  //               '03-27': 5456,
  //               '03-28': 5699,
  //               '03-29': 4787,
  //               '03-30': 4623,
  //               '03-31': 5317
  //             }
  //           },
  //           {
  //             legend: '主动服务',
  //             x: {
  //               '03-01': 70,
  //               '03-02': 109,
  //               '03-03': 370,
  //               '03-04': 440,
  //               '03-05': 154,
  //               '03-06': 309,
  //               '03-07': 269,
  //               '03-08': 100,
  //               '03-09': 466,
  //               '03-10': 573,
  //               '03-11': 389,
  //               '03-12': 6416,
  //               '03-13': 360,
  //               '03-14': 612,
  //               '03-15': 171,
  //               '03-16': 171,
  //               '03-17': 859,
  //               '03-18': 444,
  //               '03-19': 93,
  //               '03-20': 39,
  //               '03-21': 27,
  //               '03-22': 52,
  //               '03-23': 1094,
  //               '03-24': 1408,
  //               '03-25': 9655,
  //               '03-26': 391,
  //               '03-27': 1068,
  //               '03-28': 597,
  //               '03-29': 297,
  //               '03-30': 531,
  //               '03-31': 674
  //             }
  //           },
  //           {
  //             legend: '线下投诉单',
  //             x: {
  //               '03-01': 349,
  //               '03-02': 358,
  //               '03-03': 350,
  //               '03-04': 342,
  //               '03-05': 343,
  //               '03-06': 376,
  //               '03-07': 340,
  //               '03-08': 338,
  //               '03-09': 349,
  //               '03-10': 323,
  //               '03-11': 346,
  //               '03-12': 345,
  //               '03-13': 491,
  //               '03-14': 343,
  //               '03-15': 331,
  //               '03-16': 372,
  //               '03-17': 433,
  //               '03-18': 568,
  //               '03-19': 474,
  //               '03-20': 506,
  //               '03-21': 329,
  //               '03-22': 510,
  //               '03-23': 394,
  //               '03-24': 577,
  //               '03-25': 608,
  //               '03-26': 613,
  //               '03-27': 555,
  //               '03-28': 335,
  //               '03-29': 666,
  //               '03-30': 559,
  //               '03-31': 488
  //             }
  //           },
  //           {
  //             legend: '预拆机',
  //             x: {
  //               '03-01': 0,
  //               '03-02': 0,
  //               '03-03': 0,
  //               '03-04': 0,
  //               '03-05': 0,
  //               '03-06': 0,
  //               '03-07': 0,
  //               '03-08': 0,
  //               '03-09': 0,
  //               '03-10': 0,
  //               '03-11': 0,
  //               '03-12': 0,
  //               '03-13': 0,
  //               '03-14': 0,
  //               '03-15': 0,
  //               '03-16': 0,
  //               '03-17': 0,
  //               '03-18': 0,
  //               '03-19': 0,
  //               '03-20': 0,
  //               '03-21': 2,
  //               '03-22': 0,
  //               '03-23': 1,
  //               '03-24': 0,
  //               '03-25': 0,
  //               '03-26': 0,
  //               '03-27': 0,
  //               '03-28': 0,
  //               '03-29': 1,
  //               '03-30': 0,
  //               '03-31': 0
  //             }
  //           }
  //         ]
  //       }
  //     ],
  //     // 用户画像
  //     // query_chat_details: [
  //     //   {
  //     //     title: '',
  //     //     chart_type: 5,
  //     //     data: [
  //     //       {
  //     //         avatar: '/nl2sql_ui/static/pic/male1.png',
  //     //         id: 'ZJ0575A00216',
  //     //         name: '高帅',
  //     //         region: '绍兴绍兴县',
  //     //         entry_date: '2019-04-01',
  //     //         working_age: 7,
  //     //         group_name: '中国铁通绍兴分公司绍兴县家客抢修H3组',
  //     //         post: '班长',
  //     //         monitor_id: '无'
  //     //       }
  //     //     ]
  //     //   }
  //     // ],
  //     query_chat_excel: [
  //       {
  //         name: 'ZJ0575A00216',
  //         th: [
  //           {
  //             en: 'month',
  //             zh: '月份'
  //           },
  //           {
  //             en: 'region',
  //             zh: '地市'
  //           },
  //           {
  //             en: 'region',
  //             zh: '区县'
  //           },
  //           {
  //             en: 'orderid',
  //             zh: '工单号'
  //           },
  //           {
  //             en: 'mtn_username',
  //             zh: '装维人员姓名'
  //           },
  //           {
  //             en: 'mtn_yxticket',
  //             zh: '装维工号'
  //           },
  //           {
  //             en: 'order_type',
  //             zh: '工单类型'
  //           },
  //           {
  //             en: 'install_basic_salary',
  //             zh: '装机基础薪酬费用'
  //           },
  //           {
  //             en: 'star_reward_fees',
  //             zh: '星级奖励薪酬'
  //           },
  //           {
  //             en: 'fast_install_fee',
  //             zh: '快装奖惩薪酬'
  //           },
  //           {
  //             en: 'diff_fee',
  //             zh: '难度奖惩（易装回调）薪酬'
  //           },
  //           {
  //             en: 'mass_integral_fee',
  //             zh: '质量积分薪酬'
  //           },
  //           {
  //             en: 'order_salary',
  //             zh: '工单薪酬总费用'
  //           },
  //           {
  //             en: 'capital_pool_fee',
  //             zh: '资金池费用'
  //           }
  //         ],
  //         td: [
  //           {
  //             month: '202602',
  //             region: '绍兴县',
  //             orderid: 'ZJ-055-20260224104922-0009028',
  //             mtn_username: '高帅',
  //             mtn_yxticket: 'ZJ0575A00216',
  //             order_type: '宽带',
  //             install_basic_salary: '25.51',
  //             star_reward_fees: 'NULL',
  //             fast_install_fee: '0.00',
  //             diff_fee: '7.29',
  //             mass_integral_fee: 'NULL',
  //             order_salary: '25.51',
  //             capital_pool_fee: '14.98'
  //           },
  //           {
  //             month: '202602',
  //             region: '绍兴县',
  //             orderid: 'ZJ-055-20260226162829-0038100',
  //             mtn_username: '高帅',
  //             mtn_yxticket: 'ZJ0575A00216',
  //             order_type: '其他增值业务',
  //             install_basic_salary: '16.38',
  //             star_reward_fees: 'NULL',
  //             fast_install_fee: 'NULL',
  //             diff_fee: '0.0',
  //             mass_integral_fee: 'NULL',
  //             order_salary: '16.38',
  //             capital_pool_fee: '0.0'
  //           }
  //         ]
  //       }
  //     ],
  //     query_recommend_questions: [
  //       '查询高帅用户画像',
  //       '查询高帅近三月薪酬',
  //       '查询高帅近三月奖励和考核'
  //     ]
  //   },
  //   type: 'answer',
  //   // content: JSON.parse(
  //   //   '{"chat": "朱启军，男，工作于中国铁通北仑家客抢修A25组，职位为一线装维，2020年12月25日入职，工龄5年，服务区域为宁波北仑。", "query_chat_details": [{"data": [{"avatar": "/nl2sql_ui/static/pic/male5.png", "id": "ZJ0574A00886", "name": "朱启军", "region": "宁波北仑", "entry_date": "2020-12-25", "working_age": 5, "group_name": "中国铁通北仑家客抢修A25组", "post": "一线装维", "monitor_id": "ZJ0574A00784"}], "chart_type": 5}], "query_chat_excel": [], "query_recommend_questions": []}'
  //   // ),
  //   answerType: 'jiakuan_sql',
  //   loadingTexts: [
  //     { id: 0, value: '规划中......' },
  //     {
  //       id: 1,
  //       value:
  //         "任务规划候选的工具/智能体集: ['日报问答', '性能指标查询', '台风场景问答', '统一知识库问答', '图表绘制工具', '任务终止工具', '家宽服务质量指标查询', '项目介绍工具']"
  //     },
  //     { id: 2, value: "最终选中的工具/智能体集：['项目介绍工具']" },
  //     { id: 3, value: '调用：项目介绍工具 结束', type: 'endNode' }
  //   ],
  //   reasoning: '测试深度思考文案'
  // }
]
